Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection.AnalysisSubSectionSubTypeEnum Enumeration
 Defines the subsection subtypes.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisSubSectionSubTypeEnum
Public Enumeration AnalysisSubSectionSubTypeEnum
Members
Member name | Value | Description
UNKNOWN_SUBTYPE | 0 |  The subsection subtype is unknown.
I_HOT_ROLLED | 1001 |  The hot rolled I profile.
I_WELDED_SYMMETRICAL | 1002 |  The first symmetrically welded I profile.
I_WELDED_UNSYMMETRICAL | 1003 |  The first unsymmetrically welded I profile.
I_WELDED_SYMMETRICAL2 | 1004 |  The second symmetrically welded I profile.
I_WELDED_UNSYMMETRICAL2 | 1005 |  The second unsymmetrically welded I profile.
L_HOT_ROLLED | 2001 |  The hot rolled L profile.
L_COLD_ROLLED | 2002 |  The cold rolled L profile.
Z_COLD_ROLLED | 3001 |  The cold rolled Z profile.
U_HOT_ROLLED | 4001 |  The hot rolled U profile.
U_COLD_ROLLED | 4002 |  The cold rolled U profile.
PL_DEFAULT | 5001 |  The default PL profile.
D_CIRCULAR | 6001 |  The circular D profile.
D_ELLIPTICAL | 6002 |  The elliptical D profile.
PD_CIRCULAR | 7001 |  The circular PD profile.
PD_ELLIPTICAL | 7002 |  The elliptical PD profile.
PD_CIRCULAR_TAPERED | 7003 |  The circular tapered PD profile.
P_SQUARE | 8001 |  The square P profile.
P_RECTANGULAR | 8002 |  The rectangular P profile.
P_ALTERING_HEIGHT | 8003 |  The altering height P profile.
C_HOT_ROLLED | 9001 |  The hot rolled C profile.
C_COLD_ROLLED | 9002 |  The cold rolled C profile.
T_HOT_ROLLED | 10001 |  The hot rolled T profile.
T_PARAMETRIC | 10002 |  The parametric T profile.
HK_SYMMETRICAL | 11001 |  The symmetrical HK profile.
HK_UNSYMMETRICAL | 11002 |  The unsymmetrical HK profile.
HQ_CENTERED | 13001 |  The centered HQ profile.
HQ_NOT_CENTERED | 13002 |  The not centered HQ profile.
ZZ_SYMMETRICAL | 15001 |  The symmetrical ZZ profile.
ZZ_NOT_SYMMETRICAL | 15002 |  The unsymmetrical ZZ profile.
CC_SYMMETRICAL | 16001 |  The symmetrical CC profile.
CC_NOT_SYMMETRICAL | 16002 |  The unsymmetrical CC profile.
CW_SYMMETRICAL | 17001 |  The symmetrical CW profile.
CW_UNSYMMETRICAL | 17002 |  The unsymmetrical CW profile.
CU_SYMMETRICAL | 18001 |  The symmetrical CU profile.
CU_NOT_SYMMETRICAL | 18002 |  The unsymmetrical CU profile.
EB_SYMMETRICAL | 19001 |  The symmetrical EB profile.
EB_NOT_SYMMETRICAL | 19002 |  The unsymmetrical EB profile.
BF_DEFAULT | 20001 |  The default BF profile.
SPD_CIRCULAR | 21001 |  The circular SPD profile.
SPD_ELLIPTICAL | 21002 |  The elliptical SPD profile.
SPD_CIRCULAR_TAPERED | 21003 |  The circular tapered SPD profile.
EC_SYMMETRICAL | 22001 |  The symmetrical EC profile.
EC_NOT_SYMMETRICAL | 22002 |  The unsymmetrical EC profile.
ED_DEFAULT | 23001 |  The default ED profile.
EE_DEFAULT | 24001 |  The default EE profile.
EF_DEFAULT | 25001 |  The default EF profile.
EZ_DEFAULT | 26001 |  The default EZ profile.
EW_DEFAULT | 27001 |  The default EW profile.
RCDL_SYMMETRICAL | 102001 |  The symmetrical RCDL profile.
RCDL_UNSYMMETRICAL | 102002 |  The unsymmetrical RCDL profile.
RCXX_DEFAULT | 103001 |  The default RCXX profile.
RCL_DEFAULT | 104001 |  The default RCL profile.
RCDX_SYMMETRICAL | 105001 |  The symmetrical RCDX profile.
RCDX_UNSYMMETRICAL | 105002 |  The first unsymmetrical RCDX profile.
RCDX_UNSYMMETRICAL2 | 105003 |  The second unsymmetrical RCDX profile.
RCX_DEFAULT | 106001 |  The default RCX profile.
COMPONENT_FIRST | 999001 |  The component first type.
See Also
Reference
Tekla.Structures.Analysis Namespace